Autodesk.Revit.DB.View.SetNonControlledTemplateParameterIds(System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId})
Sets the parameters that will not be included when this view is used as a template.
Remarks:
This should be a subset of the parameters returned by Autodesk.Revit.DB.View.GetTemplateParameterIds (other parameters will be ignored).
newSet:
The parameter ids that should not be marked to be included.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013